let handler = async (m, { conn, command, text }) => {

let love = `
*✥━─━⌬ 𝒎𝒆𝒈𝒐_𝒃𝒐𝒕 ⌬━─━✥*
【..≼قــســم الادوات≽ ..】
*⋄━───═◞⬪⋇⬪◟═───━⋄*
❏..⚙️╎❯ .لرابط⌉*
❏..⚙️╎❯ .باركود⌉*
❏..⚙️╎❯ .ترجمه⌉*
❏..⚙️╎❯ .فضح⌉*
❏..⚙️╎❯ .تفريغ⌉*
❏..⚙️╎❯ .فحص⌉*
❏..⚙️╎❯ .تكرار⌉*
❏..⚙️╎❯ .بريد⌉*
❏..⚙️╎❯ .قص⌉*
❏..⚙️╎❯ .احسب⌉*
❏..⚙️╎❯ .جوده⌉*
❏..⚙️╎❯ .واتس⌉*
❏..⚙️╎❯ .مطلوب⌉*
❏..⚙️╎❯ .انسخ⌉*
❏..⚙️╎❯ .بينغ⌉*
*✥━─━⌬ 𝒎𝒆𝒈𝒐_𝒃𝒐𝒕 ⌬━─━✥*

 `.trim()

m.reply(love, null, { mentions: conn.parseMention(love) })}

handler.help = [ 'love' ]

handler.tags = [ 'fun' ]

handler.command = /^(الادوات)$/i

export default handler
