let handler = async (m, { conn, command, text }) => {
let love = `
*✥━─━⌬ 𝒎𝒆𝒈𝒐_𝒃𝒐𝒕 ⌬━─━✥*

【..≼قــســم التــحميــلات≽..】
*⋄━───═◞⬪⋇⬪◟═───━⋄*
❐..📥╎❯ .فيديو⌉
❐..📥╎❯ .فيديو2⌉
❐..📥╎❯ .اغنيه⌉
❐..📥╎❯ .اغاني⌉
❐..📥╎❯ .شغل⌉
❐..📥╎❯ .شغل1⌉
❐..📥╎❯ .صورة ⌉
❐..📥╎❯ .طقم⌉
❐..📥╎❯ .طقم_اولاد⌉
❐..📥╎❯ .طقم_بنات⌉
❐..📥╎❯ .البحث⌉
❐..📥╎❯ .ويكيبيديا⌉
❐..📥╎❯ .تيك⌉
❐..📥╎❯ .تيك_صور⌉
❐..📥╎❯ .يوتيوب⌉
❐..📥╎❯ .بينترست⌉
❐..📥╎❯ .فيسبوك⌉
❐..📥╎❯ .تطبيق⌉
❐..📥╎❯ .انستا⌉
❐..📥╎❯ .خلفيه⌉
❐..📥╎❯ .ميديافاير⌉
❐..📥╎❯ .مانجا⌉
❐..📥╎❯ .فريبيك⌉
❐..📥╎❯ .جيف⌉
❐..📥╎❯ .بنت⌉
❐..📥╎❯ .جوجل⌉
*✥━─━⌬ 𝒎𝒆𝒈𝒐_𝒃𝒐𝒕 ⌬━─━✥*
 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(التحميلات)$/i
export default handler
