let handler = async (m, { conn, command, text }) => {
let love = `
*✥━─━⌬〘🔥〙⌬━─━✥*

⬪  ࣪    ࣭     ࣪     ࣭   𝅦𝅦   ࣭     ࣪     ࣭    ࣪  ⬫
⬪  ࣪    ࣭     ࣪     ࣭   𝅦𝅦   ࣭     ࣪     ࣭    ࣪  ⬫
⬪࣪ꥈ𑁍⃪࣭۪ٜ݊݊݊݊݊໑ٜ࣪▭̷໋̟  ۫ 𝑾𝑬𝑳𝑪𝑶𝑴𝑬 ۫  ▭̷໋̟۪۬໑⃪࣭۪ٜ݊݊݊݊𑁍ꥈ࣪⬪
   ‏
*✥━─━⌬〘🔥〙⌬━─━✥*

*⌬〘 مرحبا بك في بوت ميجو 〙⌬*

*⌬〘 اليك قائمه الاعضاء البوت 〙⌬*

*✥━─━⌬〘🔥〙⌬━─━✥*

*❬🔥❭↜ 〚 .السورس 〛*
*❬🔥❭↜ 〚 .الخصوصيه 〛*
*❬🔥❭↜ 〚 .انطق 〛*
*❬🔥❭↜ 〚 .باركود 〛*
*❬🔥❭↜ 〚 .التوقيت 〛*
*❬🔥❭↜ 〚 .الاستماره 〛*
*❬🔥❭↜ 〚 .اختفاء 〛*

*✥━─━⌬〘🔥〙⌬━─━✥*
 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(م١|م1|اوامر الاعضاء|الاوامر الاعضاء)$/i
export default handler
