let handler = async (m, { conn, usedPrefix }) => {
    conn.reply(m.chat, `⬣━━━━━━[ سؤال ❓ ]━━━━━━╭\n*“${pickRandom(global.verdad)}”*\n⬣━━━━━━━[ ❓ ]━━━━━━━━╰`, m)
}

handler.help = ['verdad']
handler.tags = ['fun']
handler.command = /^verdad|محرج|احراج|أحراج|احرجني|أحرجني/i
handler.fail = null
export default handler

function pickRandom(list) {
    return list[Math.floor(list.length * Math.random())]
}

global.verdad = [
    "هل أعجبتك شخص ما في وقت ما؟ وكم مدة ذلك؟",
    "إذا كان ذلك ممكنًا أو إذا كنت ترغب، في الحياة الواقعية أو خارجها، من ستتكون صداقتك؟ (يمكن أن يكون مع أشخاص مختلفين أو من نفس الجنس)",
    "ما هو أكبر مخاوفك؟",
    "هل أعجبك شخص ما في وقت ما وشعرت أن هذا الشخص أيضًا يعجب بك؟",
    "ما هو اسم حبيب سابق لصديقتك الذي أعجبت به في السر؟",
    "هل سرقت مرةً واحدة مال والدتك أو والدك؟ وما هو السبب؟",
    "ما الأمور التي تجعلك سعيدًا عندما تكون حزينًا؟",
    "هل تعرضت يومًا لحب غير متبادل؟ وإذا كان الأمر كذلك، مع من كنت؟ وكيف كان شعورك؟",
    "هل سبق لك وأن كنت متورطًا في علاقة عاطفية خارجة عن القوانين؟",
    "ما هي أكبر مخاوفك؟",
    "من هو الشخص الأكثر تأثيرًا في حياتك؟",
    "ما الإنجازات التي حققتها هذا العام؟",
    "ما هو أسوأ عادة لديك في المدرسة؟",
    "ما هو برنامج التلفزيون الذي تكرهه أكثر من غيره؟ وما هو السبب؟",
    "ما هو أسوأ فستان (في رأيك) الذي ارتديته ومتى ارتديته؟",
    "ما هو أسوأ كلام (شائعة) قلته عن صديقك؟",
    "ما هو أكثر شيء تشعر بالاستحراج منه؟",
    "ما هو أول شيء تراه عندما تنظر إلى شخص آخر (من الجنس الآخر)؟",
    "ما هو أول شيء يخطر في بالك عندما تنظر إلى نفسك في المرآة؟",
    "ما هو أغبى شيء قمت به في حياتك؟",
    "ما هو أسوأ حلم رأيته؟",
    "ما هو أغرب حلم يمكنك أن تتذكره حتى الآن؟",
    "ما هو أسوأ جانب في نظرك عن نفسك؟",
    "ما هو الجانب الذي تود تغييره في نفسك؟",
    "ما هو الجانب الذي تود تغييره في صديقك؟",
    "ماذا ستفعل إذا قال لك حبيبك أن لديك أنفًا أو أصابعًا سيئة؟",
    "ماذا تفكر فيه قبل أن تنام؟ مثلاً، التخيل بشريك حياتك، إلخ.",
    "ما الذي تعتقد أنه يبرز فيك أكثر؟",
    "ما هي الجزء المفضلة من جسم صديقك وتتمنى أن تمتلكه؟",
    "ما هي الجزء المفضلة من جسمك؟ وما هو الأكثر كرهًا؟",
    "من بين جميع المواد في المدرسة، ما هي المادة التي ترغب في الانضمام إليها وما هي التي ترغب في تجنبها؟",
    "اصف صديقك الأقرب!",
    "اصف نفسك بكلمة واحدة!",
    "ما هي الأفلام والأغاني التي جعلتك تبكي؟",
    "ما هو الشيء الذي احتفظت به كسر أو أسرار، ولم يكتشفه أحد حتى الآن؟",
    "ما هو الأكثر رومانسية قد قام به شخص (من الجنس الآخر) لك؟",
    "ما هو أسوأ تجربة مزعجة عشتها؟",
    "إذا وُلدت من جديد واضطررت لتكون أحد أصدقائك، من ستختار أن تكون؟",
    "إذا كان لديك قوى خارقة، ماذا ترغب في القيام به؟",
    "إذا حدثت نهاية العالم قريبًا، ماذا ستفعل؟",
    "إذا طُلب منك أن تخضع لعملية تجميلية تستخدم صورة وجه أحد زملائك في الفصل كنموذج، من ستقلده؟",
    "هل قمت بسرقة شيء مرة واحدة على الأقل؟"
] 