let handler = async (m, { conn, command, text }) => {

    if (!text) return conn.reply(m.chat, 'أدخل اسمًا؟, او ضع منشن لأي شخص!', m)

  let personalidad = `
┓━━━°❀❬ *شخصية* ❭❀°━━━┏
*┃*
*┃• أسم* : ${text}
*┃• معنويات جيدة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• الأخلاق السيئة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• نوعية الشخص* : ${pickRandom(['ذو قلب طيب','متعجرف','بخيل','سخي','متواضع','خجول','جبان','فضولي','زجاج','لا ثنائي الجنس XD (مصطلح للتعبير عن الهوية الجنسية)', 'احمق أو غبي'])}
*┃• دائمًا* : ${pickRandom(['ثقيل','ذو حظ سيء','مشتت الانتباه','مزعج','نمام','يضيع الوقت','يتسوق','يشاهد أنمي','يتحدث على واتساب لأنه أعزب','يستلقي دون فعل أي شيء مفيد','مميل للتعامل بشكل غير جدي مع النساء','على الهاتف المحمول'])}
*┃• ذكاء* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• الأنحراف* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• شجاعة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• يخاف* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• شهرة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','93%','94%','96%','98,3%','99,7%','99,9%','1%','2,9%','0%','0,4%'])}
*┃• جنس* : ${pickRandom(['رجل', 'امرأة', 'مثلي الجنس', 'ثنائي الجنسية', 'متعدد الجنسيات', 'نسوي', 'مستقيم', 'الذكورية القوية', 'امرأة قوية', 'مرتدة', 'توجه جنسي نحو الفول', 'توجه جنسي نحو بلاي ستيشن', 'السيدة مانويلا', 'توجه جنسي نحو الدجاج'])}
┗━━━━━━━━━━━━━━━━
`
conn.reply(m.chat, personalidad, m, { mentions: conn.parseMention(personalidad) })
}
handler.help = ['personalidad *<nombre>*']
handler.tags = ['fun']
handler.command = /^personalidad|شخصيه|شخصية|الشخصيه|الشخصية/i

export default handler 

function pickRandom(list) {
  return list[Math.floor(Math.random() * list.length)]
}