let handler = async (m, { conn, command, text }) => {
let love = `
*✥━─━⌬〘🔥〙⌬━─━✥*

*≼🧧≽ قـسـم المطور╿↶*

*✥━─━⌬〘🔥〙⌬━─━✥*

*🔥╎❯ .بان⌉*
*🔥╎❯ .بان_فك⌉*
*🔥╎❯ .بان_شات⌉*
*🔥╎❯ .بان_شات_فك⌉*
*🔥╎❯ .حطها بروفايل⌉*
*🔥╎❯ .ضيف_اكسبي⌉*
*🔥╎❯ .ضيف_الماس⌉*
*🔥╎❯ .اعاده⌉*
*🔥╎❯ .اخرج⌉*
*🔥╎❯ .ادخل⌉*
*🔥╎❯ .تهكير⌉*
*🔥╎❯ .المده⌉*
*🔥╎❯ .حذف_المده⌉*
*🔥╎❯ .البلوكات⌉*
*🔥╎❯ .فك_البلوك⌉*
*🔥╎❯ .بلوك⌉*
*🔥╎❯ .بريم⌉*
*🔥╎❯ .حذف_بريم⌉*
*🔥╎❯ .المميزين⌉*
*🔥╎❯ .تسريع⌉*
*🔥╎❯ .نشر⌉*

*✥━─━⌬〘🔥〙⌬━─━✥*
 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(قاءمتي|قائمتي)$/i
export default handler
