let handler = async (m, { conn, command, text }) => {
let love = `
*✥━─━⌬ 𝒎𝒆𝒈𝒐_𝒃𝒐𝒕 ⌬━─━✥*
【..≼قــســم المــطــور≽..】
*⋄━───═◞⬪⋇⬪◟═───━⋄*
❏..🛡️╎❯ .بان⌉
❏..🛡️╎❯ .بان_فك⌉
❏..🛡️╎❯ .بان_شات⌉
❏..🛡️╎❯ .بان_شات_فك⌉
❏..🛡️╎❯ .حطها بروفايل⌉
❏..🛡️╎❯ .ضيف_الماس⌉
❏..🛡️╎❯ .ضيف_اكسبي⌉
❏..🛡️╎❯ .اعاده⌉
❏..🛡️╎❯ .اخرج⌉
❏..🛡️╎❯ .ادخل⌉
❏..🛡️╎❯ .تهكير⌉
❏..🛡️╎❯ .تنظيف⌉
❏..🛡️╎❯ .الامردا⌉
❏..🛡️╎❯ .البلوكات⌉
❏..🛡️╎❯ .فك_البلوك⌉
❏..🛡️╎❯ .بلوك⌉
❏..🛡️╎❯ .بريم⌉
❏..🛡️╎❯ .حذف_بريم⌉
❏..🛡️╎❯ .المميزين⌉
❏..🛡️╎❯ .تسريع⌉
❏..🛡️╎❯ .نشر⌉
*✥━─━⌬ 𝒎𝒆𝒈𝒐_𝒃𝒐𝒕 ⌬━─━✥*
 `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(قاءمتي|قائمتي)$/i
export default handler
